Revit 2027 API
RibbonItem.Visible Property
Gets or sets a value indicating whether the item is visible.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
member Visible : bool with get, set
Property Value
Boolean
Remarks
When the Visible property is set to false, the item won't be displayed on Ribbon.
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace